# IsCustomQuality Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingQualitySettings..::..IsCustomQuality Method
RenderingQualitySettings Class See Also
---
Checks if the current rendering quality is custom or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsCustomQuality()
```

Visual Basic
---
```text
Public Function IsCustomQuality As Boolean
```

Visual C++
---
```text
public:
bool IsCustomQuality()
```

# ### Return Value
True if the current rendering quality is custom, false otherwise.
# See Also
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace